## There are 2 Types of Functions
- ### Bulit-In Function
- ### User Define Function

## Types of Bulit - In Function
- ### Scaler
    - ## Scalar functions operate on individual values and return a single result.
    - ## They are applied to each row independently and can be used within queries to manipulate or transform data at the row level.
    -  ## E.g ROUND LEN  etc
     <hr>
    
- ### Aggregate
    -  ## Aggregate functions operate on a set of values and return a single value summarizing the information in that set.
    -  ## They are typically used with the GROUP BY clause to perform operations on a group of rows.
    -  ## E.g SUM MIN MAX etc

<br><br>
# Aggregate Functions

<br>

 - ## MAX
     - ### Maximum VaSquare Rootlues
 - ## MIN
     - ### Minimum Values
     - ### We also use Filter with Aggregate Functions
- ## AVG
    - ### Return Average
- ## SUM
    - ### Return The Sum
- ## COUNT
    - ### Count the occurrence
- ## COUNT(DISTINCT)
    -  ###  we also use Multi Functions
- ## STD
    - ### Standard Deviation
- ## VARIANCE
    - ### Variance

<br><br>
# Scaler Functions
- ## ABS
    - ### Return Value in Positive
- ## ROUND
    - ### Return Value in Round
    - ### use Specfic Decimals
- ## CEIL
    -  ### return Next Integer e.g 4.1 to 5
- ## FLOOR
    -  ### return Back Integer e.g 4.1 to 5

<br>

<br><br>

# Aggregate Functions Examples

<br>

In [1]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/csv_data

In [2]:
result = %sql SELECT * FROM csv_data.mobile
result.DataFrame().head(3)

 * mysql+pymysql://root:***@localhost:3307/csv_data
352 rows affected.

,brand_name,model,price,rating,has_5g,has_nfc,has_ir_blaster,processor_brand,num_cores,processor_speed,...,refresh_rate,num_rear_cameras,num_front_cameras,os,primary_camera_rear,primary_camera_front,extended_memory_available,extended_upto,resolution_width,resolution_height
0,oneplus,OnePlus Nord CE 2 Lite 5G,19989,81.0,True,False,False,snapdragon,8.0,2.20,...,120,3,1.0,android,64.0,16.0,1,1024.0,1080,2412
1,samsung,Samsung Galaxy A14 5G,16499,75.0,True,False,False,exynos,8.0,2.40,...,90,3,1.0,android,50.0,13.0,1,1024.0,1080,2408
2,samsung,Samsung Galaxy F23 5G (6GB RAM + 128GB),16999,80.0,True,True,False,snapdragon,8.0,2.20,...,120,3,1.0,android,50.0,8.0,1,1024.0,1080,2408

## Now Find Max price

In [3]:
result = %sql SELECT MAX(price) FROM csv_data.mobile 
result

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(239999,)]

## Find Minimum price

In [4]:
result = %sql SELECT MIN(price) FROM csv_data.mobile 
result

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(6699,)]

## Find Minimum price of samsung Brand

In [5]:
result = %sql SELECT MAX(price) FROM csv_data.mobile  WHERE brand_name = "samsung"
result

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(83000,)]

## Find The average of samsung brand rating

In [6]:
result = %sql SELECT AVG(rating) FROM csv_data.mobile WHERE brand_name = "samsung"
result

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(Decimal('79.28788'),)]

## Find The Sum of price

In [7]:
result = %sql SELECT sum(price) FROM csv_data.mobile 
result

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(Decimal('6521011'),)]

## Find total no of samsung Phones

In [8]:
result = %sql SELECT COUNT(brand_name) FROM csv_data.mobile WHERE brand_name = "samsung"
result

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(66,)]

## Find no of unqiue brands

In [10]:
result = %sql SELECT COUNT(DISTINCT(brand_name)) FROM csv_data.mobile
result

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(21,)]

## Find the STD of Screen Size

In [13]:
result = %sql SELECT STD(screen_size) FROM csv_data.mobile
result

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(0.125321,)]

## Find the variance of Screen Size

In [17]:
result = %sql SELECT VARIANCE(screen_size) FROM csv_data.mobile
result

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(0.015705,)]

<br><br>

# Scaler Functions Examples

<br>

In [26]:
result = %sql SELECT price - 100000 AS 'temp' FROM csv_data.mobile
result.DataFrame().head(3)

 * mysql+pymysql://root:***@localhost:3307/csv_data
352 rows affected.

    temp
0 -80011
1 -83501
2 -83001

### Now Use ABS to convert negative into positive

In [27]:
result = %sql SELECT ABS(price - 100000) AS 'temp' FROM csv_data.mobile
result.DataFrame().head(3)

 * mysql+pymysql://root:***@localhost:3307/csv_data
352 rows affected.

    temp
0  80011
1  83501
2  83001

## Round on rating

In [35]:
result = %sql SELECT rating/10 FROM csv_data.mobile
result.DataFrame().head(3)

 * mysql+pymysql://root:***@localhost:3307/csv_data
352 rows affected.

  rating/10
0   8.10000
1   7.50000
2   8.00000

In [36]:
result = %sql SELECT ROUND(rating/10) FROM csv_data.mobile
result.DataFrame().head(3)

 * mysql+pymysql://root:***@localhost:3307/csv_data
352 rows affected.

  ROUND(rating/10)
0                8
1                8
2                8

## Round 1 Decimal

In [37]:
result = %sql SELECT ROUND(rating/10,1) FROM csv_data.mobile
result.DataFrame().head(3)

 * mysql+pymysql://root:***@localhost:3307/csv_data
352 rows affected.

  ROUND(rating/10,1)
0                8.1
1                7.5
2                8.0

## CEIL Function

In [39]:
result = %sql SELECT CEIL(rating/10) FROM csv_data.mobile
result.DataFrame().head(3)

 * mysql+pymysql://root:***@localhost:3307/csv_data
352 rows affected.

   CEIL(rating/10)
0                9
1                8
2                8

# FLOOR Function

In [40]:
result = %sql SELECT FLOOR(rating/10) FROM csv_data.mobile
result.DataFrame().head(3)

 * mysql+pymysql://root:***@localhost:3307/csv_data
352 rows affected.

   FLOOR(rating/10)
0                 8
1                 7
2                 8